Repository: yeganehaym/CleanArchSaipaShop
Catalog: SaipaShop.EndPoints.Api/Resources/SharedResource.*.resx
Languages: fa

# Hello
source: Hi
fa: سلام

# NotEmptyValidator
source: '{PropertyName}' is required.
fa: مقدار '{PropertyName}' الزامی است.

# NotNullValidator
source: '{PropertyName}' must not be null.
fa: مقدار '{PropertyName}' نباید تهی باشد.

# EmailValidator
source: '{PropertyName}' is not a valid email address.
fa: مقدار '{PropertyName}' یک ایمیل معتبر نیست.

# EqualValidator
source: '{PropertyName}' must be equal to '{ComparisonValue}'.
fa: مقدار '{PropertyName}' باید برابر با '{ComparisonValue}' باشد.

# ExactLengthValidator
source: '{PropertyName}' must be {MaxLength} characters in length.
fa: مقدار '{PropertyName}' باید دقیقاً {MaxLength} کاراکتر باشد.

# ExclusiveBetweenValidator
source: '{PropertyName}' must be between {From} and {To} (exclusive).
fa: مقدار '{PropertyName}' باید بین {From} و {To} باشد (غیرشامل).

# InclusiveBetweenValidator
source: '{PropertyName}' must be between {From} and {To}.
fa: مقدار '{PropertyName}' باید بین {From} و {To} باشد.

# LengthValidator
source: '{PropertyName}' must be between {MinLength} and {MaxLength} characters. You entered {TotalLength} characters.
fa: طول '{PropertyName}' باید بین {MinLength} تا {MaxLength} کاراکتر باشد. شما {TotalLength} کاراکتر وارد کرده‌اید.

# MaximumLengthValidator
source: '{PropertyName}' must be less than or equal to {MaxLength} characters. You entered {TotalLength} characters.
fa: طول '{PropertyName}' باید حداکثر {MaxLength} کاراکتر باشد. شما {TotalLength} کاراکتر وارد کرده‌اید.

# MinimumLengthValidator
source: '{PropertyName}' must be greater than or equal to {MinLength} characters. You entered {TotalLength} characters.
fa: طول '{PropertyName}' باید حداقل {MinLength} کاراکتر باشد. شما {TotalLength} کاراکتر وارد کرده‌اید.

# NotEqualValidator
source: '{PropertyName}' must not be equal to '{ComparisonValue}'.
fa: مقدار '{PropertyName}' نباید برابر با '{ComparisonValue}' باشد.

# RegularExpressionValidator
source: '{PropertyName}' is not in the correct format.
fa: مقدار '{PropertyName}' قالب درستی ندارد.

# ScalePrecisionValidator
source: '{PropertyName}' must not be more than {ExpectedPrecision} digits in total, with allowance for {ExpectedScale} decimals. {Digits} digits and {ActualScale} decimals were found.
fa: مقدار '{PropertyName}' نباید بیشتر از {ExpectedPrecision} رقم داشته باشد و حداکثر {ExpectedScale} رقم اعشار مجاز است. {Digits} رقم و {ActualScale} اعشار وارد شده است.

# EmptyValidator
source: '{PropertyName}' must be empty.
fa: مقدار '{PropertyName}' باید خالی باشد.

# NullValidator
source: '{PropertyName}' must be null.
fa: مقدار '{PropertyName}' باید تهی باشد.

# EnumValidator
source: '{PropertyName}' has a range of values which does not include '{PropertyValue}'.
fa: مقدار '{PropertyName}' در لیست مجاز نیست: '{PropertyValue}'.

# CreditCardValidator
source: '{PropertyName}' is not a valid credit card number.
fa: مقدار '{PropertyName}' یک شماره کارت اعتباری معتبر نیست.

source: Username
fa: نام کاربری

# TestWithParamsError
source: Field {0} Has Entred Value {1}
fa: فیلد {0} دارای خطای شماره {1} بود

# IsRequired
source: {0} Is Required
fa: {0} اجباری است

source: Email Address
fa: آدرس ایمیل

source: Personnel Code
fa: کد پرسنلی

# Invalid
source: {0} Is Invalid
fa: {0} نامعتبر میباشد
